{
  "firmware": [
    {
      "created": "1585071511",
      "date": "3-24-20",
      "description": "<p>This patch is the latest production build from TCS. It has been used on all production throttles from release until now.</p>\r\n",
      "file": "UWT-100 R1.2 (3-24-20).bin",
      "firmware_id": "7719",
      "device": "UWT-100",
      "major_version": "2020",
      "md5sum": "035b58ded26138cd87be3843f4c42aa3",
      "minor_version": "3",
      "name": "UWT-100 R1.2 (3-24-20)",
      "sha1sum": "7651fde56339af8fd569e1e347f5b67de31e364b",
      "sha256sum": "54b08d31a91bb25ffc6aa5211934ec6117fccf60359fba3d1b98f26173089ff3",
      "size": 450353,
      "subminor_version": "24",
      "uuid": "e8dfcff5-db47-44ec-9647-1974d2d4ce3b",
      "version": "R1.2"
    },
    {
      "created": "1590098294",
      "date": "5-22-2020",
      "description": "<p>Release 1.4 fixes some major bugs:</p>\r\n\r\n<ul>\r\n\t<li><span><span><span><span><span><span>Fixed bug where single-stepping speed increase could not go past speed 49 on certain WiThrottle Protocol based systems.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>Fixed bug in Yard Mode where changing direction using the yard mode buttons sometimes caused a brief movement of the locomotive in the previous direction.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>Fixed bug where the throttle would not recall the last locomotive after a power cycle in certain situations.</span></span></span></span></span></span></li>\r\n</ul>\r\n\r\n<p><span><span><span><span><span><span>Recall:</span></span></span></span></span></span></p>\r\n\r\n<ul>\r\n\t<li><span><span><span><span><span><span>The number of available recall slots was increased from 8 to 20.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>The locomotive which is currently selected on the throttle is no longer shown in the Menu &gt; Recall list.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>The Menu &gt; Recall list title is updated to state clearly when the list is empty.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>All entries can now be deleted from the Recall List.</span></span></span></span></span></span></li>\r\n</ul>\r\n\r\n<p><span><span><span><span><span><span>Emergency Stop:</span></span></span></span></span></span></p>\r\n\r\n<ul>\r\n\t<li><span><span><span><span><span><span>An Emergency Stop can no longer be released by changing the speed, such as touching the wheel by accident.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>In the default configuration your locomotive speed will be set to zero when engaging the Emergency Stop. This will prevent your locomotive from accelerating when you release the Emergency Stop. </span></span></span></span></span></span><span><span><span><span><span><span>Note: when operating an entire show layout from a single throttle, we recommend configuring the Emergency Stop button to operate only the layout power option, and disabling the “Current Locomotive” E-Stop functionality. In this mode all locomotives retain their speed setting from prior to the E-Stop.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>It is no longer possible to </span></span></span></span></span></span><span><span><span><strong><span><span>release</span></span></strong></span></span></span><span><span><span><span><span><span> the Emergency Stop while navigating the menus or other auxiliary screens. You can still </span></span></span></span></span></span><span><span><span><strong><span><span>engage</span></span></strong></span></span></span><span><span><span><span><span><span> the E-Stop from any screen by pressing the red button (one or more times).</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>The throttle will now ask for confirmation before releasing the Emergency Stop. This makes releasing the Emergency Stop a multiple-button-press process to ensure it is intentional. On the confirmation screen we will remind you what speed your locomotive will have after releasing the E-Stop.</span></span></span></span></span></span></li>\r\n\t<li><span><span><span><span><span><span>Fixed bug where setting a locomotive to Emergency Stop then selecting a new locomotive caused the new locomotive to be incorrectly reported to be in Emergency Stop mode.</span></span></span></span></span></span></li>\r\n</ul>\r\n\r\n<p><span><span><span><span><span><span>Park Mode:</span></span></span></span></span></span></p>\r\n\r\n<ul>\r\n\t<li><span><span><span><span><span><span>Added a new action: Menu &gt; Operations &gt; Park/Un-Park Current Loco. This engages/releases the Emergency Stop function on the currently selected locomotive, regardless of the setting of the red E-Stop button. This can be used by operators whose train needs to remain stopped in a siding to prevent accidental movements of the train. The speed buttons and knob/wheel will not work while parked.</span></span></span></span></span></span></li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n",
      "file": "UWT-100 R1.4 (5-22-2020).bin",
      "firmware_id": "7759",
      "device": "UWT-100",
      "major_version": "2020",
      "md5sum": "65173cf4bac7389edc9d7e3ea182b003",
      "minor_version": "5",
      "name": "UWT-100 R1.4 (5-22-2020)",
      "sha1sum": "8f1cf698a5a480af94653d0416e3c1e5b3b24d99",
      "sha256sum": "456b3bfaba9a6d60a7f8728d05d7953f74061c5586a292cc7a2800e4c726d22a",
      "size": 451377,
      "subminor_version": "22",
      "uuid": "5099755b-4802-43b0-918d-4143f85e1ca4",
      "version": "R1.4"
    },
    {
      "created": "1598027184",
      "date": "8-21-2020",
      "description": "<h5>Release 2.0 is a major software release that adds new features, brings improvements in different areas based on the feedback of our users and our development schedule, and fixes some minor bugs.</h5>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3>New Feature - Dual Throttle:</h3>\r\n\r\n<p>The TCS UWT-100 throttle can now be used to control two locomotives at the same time. Both locomotives will be visible on the screen with their address, speed and direction.</p>\r\n\r\n<h4>Dual Throttle Mode Features:</h4>\r\n\r\n<ul>\r\n\t<li>You can enable or disable Dual Throttle Mode by going Menu &gt; Operations &gt; Dual Throttle or typing [Menu][2][6] on the keypad.</li>\r\n\t<li>The Recall key will show as ‘Swap’, to be used to flip the two throttles as long as Dual Throttle Mode is active.</li>\r\n\t<li>The single chevron keys will operate the right throttle’s speed while the double chevron keys, the thumbwheel, the direction key, and the function buttons operate the left throttle. Using the Select Loco key or Menu &gt; Recall will replace the locomotive on the left throttle.</li>\r\n\t<li>Both throttles can be independently set to drive consists. The consist change operations manipulate the consist on the left throttle.</li>\r\n\t<li>Both throttles can be independently set to Yard Mode. We recommend using the right throttle to control a locomotive in Yard Mode because the direction can be controlled by using exclusively the chevron keys without the need to swap sides or reconfigure a soft key for the Dual Direction function.</li>\r\n\t<li>If needed, a softkey such as [::] can be re-configured to operate as the Dual Direction button for the secondary throttle (In the Settings &gt; Change Buttons menu, pick “Dual Direction” from the Common Functions list).</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>We especially recommend Dual Throttle Mode for operators working a yard and users who monitor and control two locomotives at the same time.</p>\r\n\r\n<h4>Accessory and Route Support</h4>\r\n\r\n<ul>\r\n\t<li>The Accessory Control Window now has separate keys for setting a turnout to Normal or Reversed. Pressing ENTER will “throw” the switch or toggle the accessory if the underlying system supports it. More details can be found in the new <a href=\"http://docs.tcsdcc.com/wiki/UWT-100#The_.E2.80.9CHelp.E2.80.9D_Button\">Help Text</a> for the Accessory Control Window.</li>\r\n\t<li>The soft buttons in the Accessory Control Window will now highlight to show you that your command was sent to the layout.</li>\r\n\t<li><strong>Controlling turnouts over an LNWI connection is now supported</strong>. Press the Accessory key, enter the turnout number, then press the N/On or R/Off keys to set the turnout to Normal (aka. Closed) or Reversed (aka. Thrown). “Toggling” or throwing a turnout using the Enter key is not supported by the LNWI.</li>\r\n\t<li><strong>Controlling Routes via JMRI</strong>. The UWT-100 throttle is now able to show and set Routes entered into JMRI. Routes will show when pressing the Accessory key in the list after the turnouts. The list can be restricted to show routes only by typing 0 on the keypad, after which typing more digits will further restrict the shown routes. A route from the list can be activated by scrolling to highlight it, then pressing the [··] (Select) key. Blind typing is also supported, for example if you have a route called “Yard entry 28”, you can trigger that with [ACCY] [0] [2] [8] [ENTER]. NCE macros can be operated using the&nbsp;Accessory Control Window with the <a href=\"https://tcsdcc.com/NCE_Macros\">Appropriate JMRI Configuration</a>.</li>\r\n</ul>\r\n\r\n<h4>Recall Functionality</h4>\r\n\r\n<ul>\r\n\t<li>The throttle will now remember if a locomotive was in <a href=\"http://docs.tcsdcc.com/wiki/Yard_Mode\">Yard Mode</a> through power cycles and Recall button presses. This allows for seamless transitions between a switcher in Yard Mode and a road locomotive in normal mode when using the Recall key -- the throttle will automatically switch to the last used mode for each locomotive. The throttle will remember the Yard Mode setting for all recently used locomotives that are still in the Recall list (up to 20), and apply it even if you select a recently used locomotive by address.</li>\r\n\t<li>Certain system connections via JMRI are incorrectly reporting locomotives acquired as zero speed and all functions off, even if the locomotive is running on the layout. This makes the quick switching between locomotives using the Recall button very difficult to use. We recommend using Dual Throttle Mode which does not exhibit this issue and makes switching between two locomotives much faster.</li>\r\n\t<li>If you regularly need to switch between <em>more than two locomotives</em>, we added a workaround in Settings &gt; Throttle Settings &gt; Drive Settings &gt; Workaround for Recall 0 Speed. This will make the throttle keep all locomotives which were selected in the current session in a hidden consist, causing JMRI to correctly remember the locomotive state. You can still explicitly release a locomotive with Menu &gt; Operations &gt; Release/Dispatch. <strong>WARNING:</strong> this behavior can make most command stations, including old Digitrax command stations really unhappy, so make sure you only enable it if absolutely necessary. So far we’ve only seen this issue on the NCE PowerCab and PowerHouse Pro when using it via JMRI and the NCE USB or Serial connections. The WFD-30 module from WiFiTrax does successfully report speed and function status to the throttle, and does not require this workaround. Use this feature at your own risk. If transitioning between layouts and command stations, turn this feature on or off as necessary.</li>\r\n</ul>\r\n\r\n<h4>Miscellaneous Changes</h4>\r\n\r\n<ul>\r\n\t<li>Added Help text to the Select Loco and Select Accessory screens. Use the ? button on these screens to access the help.</li>\r\n\t<li>Yard Mode On/Off can now be assigned as a function to any of the eight remappable buttons (including the soft keys), allowing you to turn Yard Mode on or off on any locomotive at any time with one button press.</li>\r\n\t<li>In Yard Mode the double chevrons are permanently assigned to control the locomotive; any other functions specified for the double chevrons will be active only in Standard mode. Similarly, in Dual Throttle Mode the single chevrons are permanently assigned to the right side throttle.</li>\r\n\t<li>Added a menu option to display and control track power in Menu &gt; Settings &gt; Track Power. This menu option can control layout power on any system that supports it. Track power may still be controlled via the E-STOP button if configured as a more convenient option.</li>\r\n\t<li>The main screen will display when the throttle is in Offline mode. You may now exit Offline mode by selecting Menu &gt; Network &gt; Current Network &gt; Reconnect, or by selecting a specific profile and the Connect Now command. Previously you had to turn off the throttle to exit Offline mode.</li>\r\n\t<li>The throttle now supports pressing two buttons at the same time. For example while holding down the horn button, a chevron key in Yard Mode can be pressed. This also allows you to drive two locomotives in Dual Throttle Mode at the same time, including when both locos are in Yard Mode.</li>\r\n\t<li>When the throttle gets into the automatic network discovery after turn-on (this happens after a few seconds if reconnecting fails), it will print the name of the WiFi network it connected to on the top to aid in troubleshooting.</li>\r\n</ul>\r\n\r\n<h4>Bug Fixes</h4>\r\n\r\n<ul>\r\n\t<li>Fixed incorrect scrolling when exiting the Advanced parameters menu in the Network Profile.</li>\r\n\t<li>Fixed incorrect line breaks on the Locomotive Steal dialog.</li>\r\n\t<li>Fixed bug where it was impossible to use the E-STOP button to turn track power on when using an LNWI connection.</li>\r\n\t<li>Fixed bug where selecting Menu &gt; Network &gt; Current Network &gt; Reconnect showed a locomotive on the screen that could not be controlled. The locomotive is now correctly re-acquired after the reconnect.</li>\r\n\t<li>Fixed bug where an unintuitive error message was left on the screen in Offline mode.</li>\r\n\t<li>Fixed bug when an empty menu item was shown in the Main Menu under some circumstances.</li>\r\n\t<li>Fixed bug where selecting an accessory from the search results was sometimes impossible if it was the only result in the list.</li>\r\n\t<li>Fixed bug where the menu labels in the Consist Functions menu displayed 1 for F0.</li>\r\n\t<li>Fixed bug where “Connected to {WiFi}” message was stuck on screen under some circumstances.</li>\r\n\t<li>Fixed bug where F0/headlight was not correctly displayed after acquiring a locomotive under some circumstances.</li>\r\n\t<li>Fixed bug where the direction sign was not correctly shown in Yard Mode under some circumstances.</li>\r\n\t<li>Fixed bug where the double chevrons failed to repeatedly change speed when held down in normal speed control mode, whereas single chevrons worked with repeats.</li>\r\n</ul>\r\n",
      "file": "UWT-100 R2.0 (8-21-2020).bin",
      "firmware_id": "7888",
      "device": "UWT-100",
      "major_version": "2020",
      "md5sum": "c5e43be634f67e08dcacf1178a9245ae",
      "minor_version": "8",
      "name": "UWT-100 R2.0 (8-21-2020)",
      "sha1sum": "f3ff0514b58ab87c35e734333e00eec1c8e29109",
      "sha256sum": "c9c734aa9be14ade669d4349a342de7c34b0b946ca807e445da0538925b0c488",
      "size": 464325,
      "subminor_version": "21",
      "uuid": "5e2a004b-0e24-42ea-bed3-7c1db95996c4",
      "version": "R2.0"
    },
    {
      "created": "1613769955",
      "date": "2-19-2021",
      "description": "<h5>Release 2.2 is a sub-major software release that adds new QOL enhancements, brings improvements to existing features based on the feedback of our users and our development schedule, resolves compatibility issues, and fixes some minor bugs.<br />\r\n&nbsp;</h5>\r\n\r\n<h2>Changes:</h2>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3>User Interface</h3>\r\n\r\n<ul>\r\n\t<li>The LCD contrast can now be adjusted under Throttle Settings. The \"Backlight Settings\" menu has been renamed to \"<a href=\"http://docs.tcsdcc.com/wiki/UWT-100_Main_Menu#8_Settings\">Display Settings</a>\" to encompass more settings which are not exclusive to the backlight specifically.</li>\r\n\t<li>Improved the performance of the thumbwheel. It will be easier to make precision movements in the following situations:\r\n\t<ul>\r\n\t\t<li>Adjusting speed in small increments using the thumbwheel</li>\r\n\t\t<li><a href=\"http://docs.tcsdcc.com/wiki/UWT-100#Menu_Navigation\">Navigating the Menu</a> using the thumbwheel</li>\r\n\t\t<li><a href=\"http://docs.tcsdcc.com/wiki/UWT-100#Text_Entry\">Entering text</a></li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Fixed problems with unexpected jumps forward or backward on certain devices when the thumbwheel was rotated slowly.</li>\r\n\t<li>Implemented \"ballistic tracking\" which makes it easier to reach high speed steps or stop the loco by rotating the wheel more quickly. The throttle will track how quickly or slowly the thumbwheel is rotating, and increment/decrement the speed at a rate consistent with the speed of rotation.</li>\r\n\t<li>Decreased the overall sensitivity of the thumbwheel in menus and when entering text.</li>\r\n\t<li>Added the following named functions as select-able options for the <a href=\"http://docs.tcsdcc.com/wiki/UWT-100#Programmable_Buttons\">programmable buttons</a> (softkeys):\r\n\t<ul>\r\n\t\t<li>Air Compressor (or Air Pump)</li>\r\n\t\t<li>Coupler Clank (Coupler Close)</li>\r\n\t\t<li>Uncoupler (Coupler Open)</li>\r\n\t\t<li>Dynamic Brake</li>\r\n\t\t<li>(Prime Mover) Ignition</li>\r\n\t\t<li>Notch Up (or RPM+)</li>\r\n\t\t<li>Notch Down (or RPM-)</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Resolved an issue in the Recall Menu where deleting the last item on the list would remove the cursor from the screen and prevent the use of the thumbwheel to navigate the Recall List.</li>\r\n</ul>\r\n\r\n<h3>Accessory Window</h3>\r\n\r\n<ul>\r\n\t<li>The throttle remembers and shows the most recently selected Accessory when entering the Select Accessory screen. It is possible to change the last toggled accessory without looking at the screen by pressing the Accessory button twice. For users who use only one accessory, or frequently use the same accessory, this feature enhancement will improve your user experience!</li>\r\n</ul>\r\n\r\n<h3>LCC-related Changes (Do not affect connections over WiThrottle protocol)</h3>\r\n\r\n<ul>\r\n\t<li>Adds the ability to display and edit the configuration settings of the currently selected LCC locomotive under Settings &gt; Roster Settings.</li>\r\n\t<li>Adds the ability to display and edit the configuration settings of an LCC Command Station under Settings &gt; DCC System Settings.</li>\r\n\t<li>Implements consist member change direction in LCC mode.</li>\r\n\t<li>Updates dot key assignment in the CV programming screen.</li>\r\n\t<li>Adds support for Paged Mode CV programming.</li>\r\n\t<li>Prevents entering the mainline programming menu in LCC mode when the locomotive has been released.</li>\r\n\t<li>Updates locomotive control to the most recent draft of the Traction Protocol. Adds support for heartbeats.</li>\r\n</ul>\r\n\r\n<h3>Bug Fixes</h3>\r\n\r\n<ul>\r\n\t<li>Fixes a rare crash when changing configuration.</li>\r\n\t<li>Fixes directional headlights flickering/rapidly-toggling after changing direction when connected to certain systems in WiThrottle mode.</li>\r\n\t<li>Fixes unexpected direction changes in WiThrottle mode when a non-consisted locomotive is edited in the Consist Menu to be set to reverse direction.</li>\r\n\t<li>The throttle now always shows the current cab’s direction on the main screen. If the current cab’s direction is changed in the consisting settings, the direction of all other consisted locomotives will be flipped instead.</li>\r\n\t<li>Fixes unexpected direction change in a WiThrottle mode consist when switching to a cab that is in reverse direction.</li>\r\n</ul>\r\n\r\n<h3>Misc Changes</h3>\r\n\r\n<ul>\r\n\t<li>Added a \"Privacy Mode\" setting to Menu &gt; Settings &gt; <a href=\"http://docs.tcsdcc.com/wiki/UWT-100_Main_Menu#8.5_Network_Settings\">Network Settings</a>. This setting allows users to hide their throttle’s hardware identifier from the WiFi network. This setting addresses an issue some customers have when connecting to an LNWI. See the notes below related to this issue.</li>\r\n</ul>\r\n\r\n<h2>Compatibility Fix (LNWI)</h2>\r\n\r\n<p>TCS was informed by our customers that some recently manufactured LNWI devices have connection issues. The error presented itself on some specific UWT-100 throttles when selecting a locomotive, even though it seemed that other devices work fine on the same LNWI. TCS determined that this issue is not specific to the TCS throttles, and also impacts some mobile phones in certain situations. With kind assistance from Digitrax, this issue has been traced back to a batch of LNWI devices manufactured with an incompatible software release. If you encounter this issue yourself, please <a href=\"https://www.digitrax.com/downloads/\">update the software version on your LNWI device</a>, or contact <a href=\"https://www.digitrax.com/support/\">Digitrax Support</a>. On a UWT-100 you can enable ‘Privacy Mode’ as a workaround, but we recommend performing the firmware update of the LNWI device.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a href=\"https://tcsdcc.com/update_with_depot\">CLICK HERE</a> for instructions on how to install the update</h3>\r\n\r\n<p><a href=\"https://tcsdcc.com/update_with_depot\">https://tcsdcc.com/update_with_depot</a></p>\r\n",
      "file": "UWT-100 R2.2 (2-19-2021).bin",
      "firmware_id": "8124",
      "device": "UWT-100",
      "major_version": "2021",
      "md5sum": "851456f2c18e04661c893cc7d61fb997",
      "minor_version": "2",
      "name": "UWT-100 R2.2 (2-19-2021)",
      "sha1sum": "84530244b352e2a9fd2a959619d7aba5eca85adf",
      "sha256sum": "f55dddbe6e76a5f38ffe8dd36bf3bd8f75a7535cea0932a86689ed1fd39c25be",
      "size": 478218,
      "subminor_version": "19",
      "uuid": "8a117d23-469e-41b3-8d4b-38e28b11400a",
      "version": "R2.2"
    },
    {
      "created": "1646165478",
      "date": "3-01-2022",
      "description": "<p>Initial release version software for UWT-50 devices. Matches release 2.4 for UWT-100's.</p>\r\n",
      "file": "UWT-50 R2.4 (3-01-2022).bin",
      "firmware_id": "8437",
      "device": "UWT-50",
      "major_version": "2022",
      "md5sum": "ce5e65adacd93daa8ac82b825bdb915e",
      "minor_version": "3",
      "name": "UWT-50 R2.4 (3-01-2022)",
      "sha1sum": "cb849cafbf2c1fbd4631cab8a2bb12f1da6c2a6d",
      "sha256sum": "bc8159999beff3d5fcc863ab2e43d18f69e405e98280b1815bd595ba7416514e",
      "size": 525231,
      "subminor_version": "1",
      "uuid": "2227d197-b74e-4bee-9ee9-f2ab01ebcbb8",
      "version": "R2.4"
    },
    {
      "created": "1646166065",
      "date": "3-01-2022",
      "description": "<p>2.4 Production release software for UWT-100. Adds fast clock.</p>\r\n",
      "file": "UWT-100 R2.4 (3-01-2022).bin",
      "firmware_id": "8438",
      "device": "UWT-100",
      "major_version": "2022",
      "md5sum": "5773ffacd33b2314899f747b6929a195",
      "minor_version": "3",
      "name": "UWT-100 R2.4 (3-01-2022)",
      "sha1sum": "a676b84b844521e52ad153efc5bc6a098c3fcb5c",
      "sha256sum": "c14d5b66072798cd2cf2ff5b6145a9257849882d562f31f24b77eaa7335a0783",
      "size": 504937,
      "subminor_version": "1",
      "uuid": "7a3f2a71-ef8b-4db0-bef9-25a87d1c5098",
      "version": "R2.4"
    },
    {
      "created": "1664482614",
      "date": "09-30-2022",
      "description": "<p>Release 3.0 UWT-50 software. Adds full support for CS-105.</p>\r\n",
      "device": "UWT-50",
      "file": "UWT-50 R3.0 (09-30-2022).bin",
      "firmware_id": "8646",
      "major_version": "2022",
      "md5sum": "3211b26c2cd116702297e6f5b11845a1",
      "minor_version": "9",
      "name": "UWT-50 R3.0 (09-30-2022)",
      "sha1sum": "232371fb5225e477fa8d8f34e33ca78fec703119",
      "sha256sum": "84242fad8eb3dea74ad9845622ef427022e1277ccd35060a4e9bf165c548350a",
      "size": 617029,
      "subminor_version": "30",
      "uuid": "5937b51b-2396-41d3-b21f-9178f538b1e6",
      "version": "R3.0"
    },
    {
      "created": "1664482777",
      "date": "09-30-2022",
      "description": "<p>Release 3.0 UWT-100 software. Adds full support for CS-105.</p>\r\n",
      "file": "UWT-100 R3.0 (09-30-2022).bin",
      "firmware_id": "8644",
      "device": "UWT-100",
      "major_version": "2022",
      "md5sum": "74fe6ed9ac7ce279711405c8a98fedd5",
      "minor_version": "9",
      "name": "UWT-100 R3.0 (09-30-2022)",
      "sha1sum": "e15f5d1c3ac3f1213b38fd0bbaa24ed65d66eb98",
      "sha256sum": "da2852c343c4d0e4002dace42307276eedd18ddc2946bfe6601cb07250c6c8c8",
      "size": 607908,
      "subminor_version": "30",
      "uuid": "03c89371-96e6-4d43-bbf7-9ace53e5dcdd",
      "version": "R3.0"
    }
  ]
}
